{
  "backend/main.mo": "Main Motoko actor defining types (GovernmentScheme, AgriculturalResource, MarketPrice, SupportContact, WeatherData, CrisisReport, CropStat) and CRUD functions for managing government schemes, agricultural resources, market prices, support contacts, crisis reports, and crop statistics with stable storage maps.",
  "feature_evidence.json": "Feature evidence report documenting the WhatsApp phone number replacement task (from +91 98765 43210 to 9040117361) in HomePage.tsx with high confidence.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files describing styling (OKLCH colors, Playfair Display font, elegant shadows), routing structure, layout components, pages (home with emergency support, schemes, resources, support, market prices), and various UI components with their specific features.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, defining design tokens for background, foreground, primary, secondary, destructive, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'Odisha Agriculture Support App', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining routes for home (/), schemes, resources, support, and market prices pages, all wrapped in Layout with HelpButton.",
  "frontend/src/components/BestPracticesSection.tsx": "Component fetching and displaying agricultural best practices resources filtered by ResourceType.bestPractice with loading skeletons, error handling, and empty state.",
  "frontend/src/components/CrisisInterventionForm.tsx": "Form component for submitting crisis reports with fields for farmer name, location, contact, crisis type, and description, using useCrisisReport hook with success dialog.",
  "frontend/src/components/CrisisResourcesSection.tsx": "Static informational section displaying four crisis support resource cards covering recognizing signs, talking to someone, professional support, and reassurance messaging.",
  "frontend/src/components/CropCalendar.tsx": "Displays a tabbed calendar showing planting and harvesting schedules for Kharif, Rabi, and Summer crops with hardcoded crop data.",
  "frontend/src/components/CropStatistics.tsx": "Renders interactive line and bar charts showing 3-year historical yield and price trends for selected crops using Recharts and a custom hook.",
  "frontend/src/components/EmergencyHelpline.tsx": "Displays a prominent card with 24/7 crisis helpline numbers including National Crisis Helpline, Kisan Call Centre, and Odisha Agriculture Helpline.",
  "frontend/src/components/FinancialLiteracySection.tsx": "Fetches and displays financial literacy resources using the useResources hook with loading, error, and empty states.",
  "frontend/src/components/Footer.tsx": "Renders a three-column footer with app info, emergency support contact, quick links, and a caffeine.ai attribution.",
  "frontend/src/components/HelpButton.tsx": "Fixed floating button in the bottom-right corner that links to the emergency support page with pulsing animation.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Navigation, page children, and Footer in a flex column structure.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar with desktop menu and mobile sheet drawer, featuring main nav items and a prominent emergency support button.",
  "frontend/src/components/PriceCard.tsx": "Card component displaying market price information for a commodity including price, unit, and market location with hover effects.",
  "frontend/src/components/PriceTable.tsx": "Displays a table of market prices for commodities with columns for commodity name, price (in rupees), unit, and market location with a map pin icon.",
  "frontend/src/components/ResourceCard.tsx": "Renders a card component for agricultural resources with type-specific icons and color schemes for best practices, financial literacy, and stress management resources.",
  "frontend/src/components/SchemeCard.tsx": "Displays government scheme information in an expandable card with accordions for eligibility criteria, application process, and contact information, differentiated by central/state level.",
  "frontend/src/components/SchemeFilters.tsx": "Provides filter buttons to toggle between all schemes, central schemes, and state schemes.",
  "frontend/src/components/SeasonalAdvisories.tsx": "Shows region-specific farming advisories for four regions of Odisha (Coastal, Northern, Southern, Western) with district lists and key recommendations in an accordion layout.",
  "frontend/src/components/StressManagementSection.tsx": "Displays wellness and stress management resources with a prominent crisis alert linking to emergency support, fetching and rendering stress management resources using the useResources hook.",
  "frontend/src/components/SupportContactCard.tsx": "Renders a contact card for support organizations with phone and email information, including clickable call and email action buttons.",
  "frontend/src/components/WeatherInfo.tsx": "Shows real-time weather data (temperature, humidity, wind speed, conditions) for selectable Odisha locations using the useWeatherData hook with a location dropdown selector.",
  "frontend/src/contexts/LanguageContext.tsx": "Empty file, likely intended for language/localization context but not yet implemented.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP backend actor with Internet Identity authentication, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCrisisReport.ts": "React hook for submitting crisis reports using a mutation that calls the backend actor's reportCrisis method and invalidates the crisisReports query cache on success.",
  "frontend/src/hooks/useCropStatistics.ts": "Provides three React Query hooks for fetching crop statistics: by crop name, by year, or by region, all using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication with React context, providing login/logout functionality, identity management, and status tracking for ICP authentication.",
  "frontend/src/hooks/useMarketPrices.ts": "React Query hook that fetches all market prices from the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Minimal placeholder file indicating feature-specific query hooks are in separate files.",
  "frontend/src/hooks/useResources.ts": "React Query hook for fetching agricultural resources, optionally filtered by resource type.",
  "frontend/src/hooks/useSchemes.ts": "React Query hook for fetching government schemes, either all schemes or filtered by scheme level.",
  "frontend/src/hooks/useSupportContacts.ts": "React Query hook that fetches all support contacts from the backend actor.",
  "frontend/src/hooks/useTranslation.ts": "Empty file, likely a placeholder for future internationalization functionality.",
  "frontend/src/hooks/useWeatherData.ts": "React Query hook that fetches weather data for a location from the backend, with fallback mock data and 30-minute refetch intervals.",
  "frontend/src/i18n/translations.ts": "Empty file, likely a placeholder for translation strings.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a blue-purple color scheme, dark mode support, custom shadows, and animations for the agricultural support application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring emergency helpline, hero section, WhatsApp support integration, crop calendar, weather info, and seasonal advisories for Odisha farmers.",
  "frontend/src/pages/MarketPricesPage.tsx": "Displays current commodity market prices in Odisha with toggleable grid and table views, using the useMarketPrices hook.",
  "frontend/src/pages/ResourcesPage.tsx": "Tabbed page displaying agricultural resources organized into best practices, financial literacy, and wellness/stress management sections.",
  "frontend/src/pages/SchemesPage.tsx": "React page component that displays government agricultural schemes for Odisha farmers with filtering by scheme level (central/state/all), loading states, and error handling using a grid layout of SchemeCard components.",
  "frontend/src/pages/SupportPage.tsx": "React page component for help and support resources featuring emergency helpline, crisis intervention form, crisis resources section, and a grid of support organization contacts in Odisha with loading and error states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom design tokens including OKLCH color system, typography (Playfair Display and Inter fonts), custom spacing, shadow utilities (warm and elegant variants), and animation keyframes for accordions and fade effects.",
  "project_state.json": "Project metadata file tracking one completed feature to replace WhatsApp phone number from +91 98765 43210 to 9040117361 in the HomePage component."
}